export const REG_EXP = {
  /**
   * 키가 2~3개 모두 매치하는 정규식
   * @description
   * 예1) 11111:22222:33333:颜色:S;
   * index_0 : '11111:22222:33333:颜色:S'
   * index_1 : '11111'
   * index_2 : '22222'
   * index_3 : '33333'
   * index_4 : '颜色'
   * @description
   * 예2) 11111:22222:颜色:S;
   * index_0 : '11111:22222:颜色:S'
   * index_1 : '11111'
   * index_2 : undefined
   * index_3 : '22222'
   * index_4 : '颜色'
   */
  taobaoOption_1: /([-\d]+):?([-\d]+)?:([-\d]+):(.+):.*;?/,
  /**
   *  옵션5개까지 매치하는 정규식
   *  @description index:2 는 사용하지 않음 (필요없는 키값)
   */
  taobaoOption_2:
    /^([-\d]+):?([-\d]+)?:([-\d]+);?([-\d]+)?:?([-\d]+)?;?([-\d]+)?:?([-\d]+)?;?([-\d]+)?:?([-\d]+)?;?([-\d]+)?:?([-\d]+)?/,
};
